Repository: harrysxu/MigraineNoteIOS
Catalog: migraine_note/migraine_note/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant

# reminder.empty
source: No reminders
zh_hans: 暂无用药提醒
zh_hant: 暫無用藥提醒

# reminder.emptyHint
source: Add reminders to never miss a dose
zh_hans: 添加提醒，按时服药不遗忘
zh_hant: 添加提醒，按時服藥不遺忘

# reminder.add
source: Add reminder
zh_hans: 添加提醒
zh_hant: 添加提醒

# reminder.edit
source: Edit reminder
zh_hans: 编辑提醒
zh_hant: 編輯提醒

# reminder.medicationInfo
source: Medication info
zh_hans: 药物信息
zh_hant: 藥物資訊

# reminder.selectMedication
source: Select medication
zh_hans: 选择药物
zh_hant: 選擇藥物

# reminder.manualInput
source: Manual input
zh_hans: 手动输入
zh_hant: 手動輸入

# reminder.medicationName
source: Medication name
zh_hans: 药物名称
zh_hant: 藥物名稱

# reminder.dosage
source: Dosage
zh_hans: 剂量
zh_hant: 劑量

source: Reminder time
zh_hans: 提醒时间
zh_hant: 提醒時間

# reminder.repeat
source: Repeat
zh_hans: 重复
zh_hant: 重複

# reminder.daily
source: Daily
zh_hans: 每天提醒
zh_hant: 每天提醒

# reminder.delete
source: Delete reminder
zh_hans: 删除提醒
zh_hant: 刪除提醒

source: Reminder added
zh_hans: 提醒已添加
zh_hant: 提醒已添加

source: Reminder updated
zh_hans: 提醒已更新
zh_hant: 提醒已更新

source: Reminder deleted
zh_hans: 提醒已删除
zh_hant: 提醒已刪除

# medication.cabinet
source: Medicine cabinet
zh_hans: 药箱
zh_hant: 藥箱

# medication.cabinetEmpty
source: Cabinet is empty
zh_hans: 药箱是空的
zh_hant: 藥箱是空的

# medication.addHint
source: Add common medications for quick recording
zh_hans: 添加您常用的药物以便快速记录
zh_hant: 添加您常用的藥物以便快速記錄

# medication.add
source: Add medication
zh_hans: 添加药物
zh_hant: 添加藥物

# medication.select
source: Select medication
zh_hans: 选择药物
zh_hant: 選擇藥物

# medication.searchPrompt
source: Search medication
zh_hans: 搜索药物名称
zh_hant: 搜索藥物名稱

# medication.noResults
source: No matching medications
zh_hans: 未找到匹配的药物
zh_hant: 未找到匹配的藥物

# medication.noResultsHint
source: Try adjusting search or filters
zh_hans: 尝试调整搜索或筛选条件
zh_hant: 嘗試調整搜索或篩選條件

# medication.addRecord
source: Add medication record
zh_hans: 添加用药记录
zh_hant: 添加用藥記錄

# medication.standardDoseHint
source: Use standard dose: %@ %@
zh_hans: 使用标准剂量：%@ %@
zh_hant: 使用標準劑量：%@ %@

# medication.filter.all
source: All
zh_hans: 全部
zh_hant: 全部

# medication.filter.acute
source: Acute
zh_hans: 急性用药
zh_hant: 急性用藥

# medication.filter.preventive
source: Preventive
zh_hans: 预防性用药
zh_hant: 預防性用藥

# component.custom
source: Custom
zh_hans: 自定义
zh_hant: 自訂

# weekday.sunday
source: Sun
zh_hans: 周日
zh_hant: 週日

# weekday.monday
source: Mon
zh_hans: 周一
zh_hant: 週一

# weekday.tuesday
source: Tue
zh_hans: 周二
zh_hant: 週二

# weekday.wednesday
source: Wed
zh_hans: 周三
zh_hant: 週三

# weekday.thursday
source: Thu
zh_hans: 周四
zh_hant: 週四

# weekday.friday
source: Fri
zh_hans: 周五
zh_hant: 週五

# weekday.saturday
source: Sat
zh_hans: 周六
zh_hant: 週六

# menstrual.title
source: Menstrual correlation
zh_hans: 经期关联分析
zh_hant: 經期關聯分析

# menstrual.fromHealth
source: From Apple Health
zh_hans: 来自 Apple 健康
zh_hant: 來自 Apple 健康

# menstrual.authorize
source: Authorize
zh_hans: 授权
zh_hant: 授權

# menstrual.loading
source: Analyzing menstrual data...
zh_hans: 正在分析经期数据...
zh_hant: 正在分析經期數據...

# menstrual.loadFailed
source: Data load failed
zh_hans: 数据加载失败
zh_hant: 數據加載失敗

# menstrual.retry
source: Retry
zh_hans: 重试
zh_hant: 重試

# menstrual.notAvailable
source: Apple Health not supported on this device
zh_hans: 此设备不支持 Apple 健康
zh_hant: 此設備不支持 Apple 健康

# menstrual.healthKitRequired
source: Requires HealthKit on iOS
zh_hans: 需要 iOS 设备上的 HealthKit 功能
zh_hant: 需要 iOS 設備上的 HealthKit 功能

# menstrual.connectHealth
source: Connect Apple Health data
zh_hans: 连接 Apple 健康数据
zh_hant: 連接 Apple 健康數據

# menstrual.healthKitRead
source: Read period data via HealthKit
zh_hans: 使用 HealthKit 读取经期数据
zh_hant: 使用 HealthKit 讀取經期數據

# menstrual.privacyHint
source: Authorize to read period data from Health app and analyze correlation with migraines.
zh_hans: 授权后将从「健康」App 自动读取您的经期数据，分析月经周期与偏头痛发作的关联，帮助识别月经性偏头痛。
zh_hant: 授權後將從「健康」App 自動讀取您的經期數據，分析月經週期與偏頭痛發作的關聯，幫助識別月經性偏頭痛。

# menstrual.localOnly
source: All data analyzed locally, never uploaded
zh_hans: 所有数据仅在本地分析，不会上传到任何服务器
zh_hant: 所有數據僅在本地分析，不會上傳到任何伺服器

# menstrual.noData
source: No period records
zh_hans: 未找到经期记录
zh_hant: 未找到經期記錄

# menstrual.noDataHint
source: Record period data in Health app: Health → Browse → Cycle Tracking
zh_hans: 请在「健康」App 中记录经期数据。打开「健康」→「浏览」→「经期追踪」进行记录。
zh_hant: 請在「健康」App 中記錄經期數據。打開「健康」→「瀏覽」→「經期追蹤」進行記錄。

# menstrual.insufficientData
source: Insufficient period data
zh_hans: 经期数据不足
zh_hant: 經期數據不足

# menstrual.insufficientHint
source: At least 2 complete cycles needed. Continue recording in Health app.
zh_hans: 至少需要 2 个完整的月经周期才能进行关联分析。请在「健康」App 中继续记录经期数据。
zh_hant: 至少需要 2 個完整的月經週期才能進行關聯分析。請在「健康」App 中繼續記錄經期數據。

# menstrual.menstrualMigraine
source: Possible menstrual migraine
zh_hans: 可能存在月经性偏头痛
zh_hant: 可能存在月經性偏頭痛

# menstrual.avgCycle
source: Avg cycle
zh_hans: 平均周期
zh_hant: 平均週期

# menstrual.periodRelated
source: Period-related attacks
zh_hans: 经期相关发作
zh_hant: 經期相關發作

# menstrual.analyzedCount
source: Analyzed attacks
zh_hans: 分析发作数
zh_hant: 分析發作數

# menstrual.timingDuring
source: During period
zh_hans: 经期中
zh_hant: 經期中

# menstrual.timingBefore
source: 2 days before
zh_hans: 经前2天
zh_hant: 經前2天

# menstrual.timingOther
source: Other
zh_hans: 其他时间
zh_hant: 其他時間

# menstrual.phaseDistribution
source: Attacks by cycle phase
zh_hans: 周期各阶段发作次数
zh_hant: 週期各階段發作次數

# menstrual.timingDistribution
source: Attack timing
zh_hans: 发作时机分布
zh_hant: 發作時機分布

# common.daysFormat
source: %d days
zh_hans: %d 天
zh_hant: %d 天

# common.timesFormat
source: %d times
zh_hans: %d 次
zh_hant: %d 次

# common.time
source: Time
zh_hans: 时间
zh_hant: 時間

# medication.type.acute
source: Acute
zh_hans: 急性
zh_hant: 急性

# medication.type.preventive
source: Preventive
zh_hans: 预防
zh_hant: 預防

# medication.section.selection
source: Medication selection
zh_hans: 药物选择
zh_hant: 藥物選擇

# medication.selectFromCabinet
source: Select from cabinet
zh_hans: 从药箱选择
zh_hant: 從藥箱選擇

# medication.totalItems
source: %d medications
zh_hans: 共%d个药品
zh_hant: 共%d個藥品

# medication.manualInputPlaceholder
source: Or enter medication name manually
zh_hans: 或手动输入药物名称
zh_hant: 或手動輸入藥物名稱

# medication.existsInCabinetHint
source: Already in cabinet, tap above to select
zh_hans: 药箱中已有此药品，可点击上方【从药箱选择】
zh_hant: 藥箱中已有此藥品，可點擊上方【從藥箱選擇】

# medication.unit
source: Unit
zh_hans: 单位
zh_hant: 單位

# medication.unit.tablet
source: Tablet
zh_hans: 片
zh_hant: 片

# medication.unit.capsule
source: Capsule
zh_hans: 粒
zh_hant: 粒

# medication.section.time
source: Time taken
zh_hans: 服用时间
zh_hant: 服用時間

# medication.syncToCabinet
source: Sync to cabinet
zh_hans: 同步到药箱
zh_hant: 同步到藥箱

# medication.defaultSyncSettings
source: Default settings will be used:
zh_hans: 将使用以下默认设置:
zh_hant: 將使用以下默認設置:

# medication.syncDefault.type
source: • Type: Other
zh_hans: • 药物类型: 其他
zh_hant: • 藥物類型: 其他

# medication.syncDefault.usage
source: • Usage: Acute
zh_hans: • 用药类型: 急需用药
zh_hant: • 用藥類型: 急需用藥

# medication.syncDefault.dose
source: • Standard dose: 1
zh_hans: • 标准剂量: 1
zh_hant: • 標準劑量: 1

# medication.syncDefault.inventory
source: • Inventory: 6
zh_hans: • 库存: 6
zh_hant: • 庫存: 6

# medication.cabinetManage
source: Cabinet management
zh_hans: 药箱管理
zh_hant: 藥箱管理

# medication.editAfterSave
source: Edit details in cabinet after saving
zh_hans: 保存后可在药箱中修改详细信息
zh_hant: 保存後可在藥箱中修改詳細信息

# medication.deleteConfirm
source: Delete "%@" from cabinet? Related medication logs will not be deleted.
zh_hans: 确定要从药箱中删除「%@」吗？相关的用药记录不会被删除。
zh_hant: 確定要從藥箱中刪除「%@」嗎？相關的用藥記錄不會被刪除。

# medication.standardDose
source: Standard dose
zh_hans: 标准剂量
zh_hant: 標準劑量

# medication.inventory
source: Inventory
zh_hans: 库存
zh_hant: 庫存

# medication.monthlyUsage
source: Monthly usage
zh_hans: 本月使用
zh_hant: 本月使用

# medication.usageLimitFormat
source: / %d days
zh_hans: / %d 天
zh_hant: / %d 天

# medication.namePlaceholder
source: Medication name
zh_hans: 药物名称
zh_hant: 藥物名稱

# medication.viewAllPresets
source: View all %d presets...
zh_hans: 查看全部 %d 个预设...
zh_hant: 查看全部 %d 個預設...

# medication.section.basic
source: Basic info
zh_hans: 基本信息
zh_hant: 基本資訊

# medication.category
source: Category
zh_hans: 药物类别
zh_hant: 藥物類別

# medication.usageType
source: Usage type
zh_hans: 用药类型
zh_hant: 用藥類型

# medication.section.inventory
source: Inventory
zh_hans: 库存管理
zh_hant: 庫存管理

# medication.currentInventory
source: Current inventory
zh_hans: 当前库存
zh_hant: 當前庫存

# medication.monthlyLimit
source: Monthly limit
zh_hans: 月度限制
zh_hant: 月度限制

# medication.mohWarning
source: MOH risk warning when exceeding this limit
zh_hans: 超过此天数将触发MOH（药物过度使用头痛）风险警告
zh_hant: 超過此天數將觸發MOH（藥物過度使用頭痛）風險警告

# medication.mohPrevention
source: MOH prevention
zh_hans: MOH预防
zh_hant: MOH預防

# medication.mohGuideline
source: Per China Migraine Guidelines 2024: NSAID ≥15 days/month, triptans/ergotamine/opioids ≥10 days/month may cause MOH
zh_hans: 根据《中国偏头痛指南2024》，NSAID类药物使用≥15天/月，曲普坦类、麦角胺类、阿片类使用≥10天/月可能导致MOH
zh_hant: 根據《中國偏頭痛指南2024》，NSAID類藥物使用≥15天/月，曲普坦類、麥角胺類、阿片類使用≥10天/月可能導致MOH

# medication.section.notes
source: Notes
zh_hans: 备注
zh_hant: 備註

# medication.browsePresets
source: Browse matching medications
zh_hans: 浏览所有匹配的常用药物
zh_hant: 瀏覽所有匹配的常用藥物

# medication.selectFromPresets
source: Select from common medications
zh_hans: 从常用药物列表选择
zh_hant: 從常用藥物列表選擇

# medication.presetsList
source: Common medications
zh_hans: 常用药物列表
zh_hant: 常用藥物列表

# medication.searchPromptExtended
source: Search by name or category
zh_hans: 搜索药物名称或类别
zh_hant: 搜索藥物名稱或類別

# component.addCustomLabel
source: Add custom %@
zh_hans: 添加自定义%@
zh_hant: 添加自訂%@

# component.labelInputHint
source: Enter label name (%d-%d chars) for quick selection
zh_hans: 输入标签名称(%d-%d个字符)，方便下次快速选择
zh_hant: 輸入標籤名稱(%d-%d個字符)，方便下次快速選擇

# component.addCustomLabelTitle
source: Add custom label
zh_hans: 添加自定义标签
zh_hant: 添加自訂標籤

# component.labelNamePlaceholder
source: Label name
zh_hans: 标签名称
zh_hant: 標籤名稱

# component.category.westernSymptom
source: Western symptom
zh_hans: 西医症状
zh_hant: 西醫症狀

# component.category.tcmSymptom
source: TCM symptom
zh_hans: 中医症状
zh_hant: 中醫症狀

# component.category.symptom
source: Symptom
zh_hans: 症状
zh_hant: 症狀

# component.category.trigger
source: Trigger
zh_hans: 诱因
zh_hant: 誘因

# component.category.painQuality
source: Pain quality
zh_hans: 疼痛性质
zh_hant: 疼痛性質

# component.category.intervention
source: Non-drug intervention
zh_hans: 非药物干预
zh_hant: 非藥物干預

# component.category.aura
source: Aura type
zh_hans: 先兆类型
zh_hant: 先兆類型

# component.label.added
source: Added: %@
zh_hans: 已添加: %@
zh_hant: 已添加: %@

# component.labelError.empty
source: Label name cannot be empty
zh_hans: 标签名称不能为空
zh_hant: 標籤名稱不能為空

# component.labelError.tooShort
source: At least %d characters required
zh_hans: 标签名称至少需要%d个字符
zh_hant: 標籤名稱至少需要%d個字符

# component.labelError.tooLong
source: Max %d characters
zh_hans: 标签名称不能超过%d个字符
zh_hant: 標籤名稱不能超過%d個字符

# component.labelError.duplicate
source: Label already exists
zh_hans: 该标签已存在
zh_hant: 該標籤已存在

# component.labelError.invalid
source: Invalid label name
zh_hans: 标签名称无效
zh_hant: 標籤名稱無效

# component.labelError.failed
source: Operation failed
zh_hans: 操作失败
zh_hant: 操作失敗

# component.labelError.addFailed
source: Failed to add, please retry
zh_hans: 添加失败，请重试
zh_hant: 添加失敗，請重試

# symptom.nausea
source: Nausea
zh_hans: 恶心
zh_hant: 噁心

# symptom.vomit
source: Vomit
zh_hans: 呕吐
zh_hant: 嘔吐

# viewmodel.medication.sort.name
source: Name
zh_hans: 名称
zh_hant: 名稱

# viewmodel.medication.sort.usageFrequency
source: Usage frequency
zh_hans: 使用频次
zh_hant: 使用頻次

# viewmodel.medication.sort.inventory
source: Inventory
zh_hans: 库存
zh_hant: 庫存

# viewmodel.medication.sort.dateAdded
source: Date added
zh_hans: 添加日期
zh_hant: 添加日期

# viewmodel.medication.mohExceeded
source: Exceeded MOH limit (%d days)
zh_hans: 已超过MOH阈值(%d天)
zh_hant: 已超過MOH閾值(%d天)

# viewmodel.medication.mohApproaching
source: Approaching MOH limit (%d days left)
zh_hans: 接近MOH阈值(还剩%d天)
zh_hant: 接近MOH閾值(還剩%d天)

# viewmodel.medication.deletedFromCabinet
source: %@ removed from cabinet
zh_hans: %@ 已从药箱中删除
zh_hant: %@ 已從藥箱中刪除

# viewmodel.medication.deleteFailed
source: Failed to delete medication, please retry
zh_hans: 删除药物失败，请重试
zh_hant: 刪除藥物失敗，請重試

# viewmodel.medication.updateInventoryFailed
source: Failed to update inventory, please retry
zh_hans: 更新库存失败，请重试
zh_hant: 更新庫存失敗，請重試

# medication.deleteConfirmTitle
source: Confirm delete medication
zh_hans: 确认删除药物
zh_hant: 確認刪除藥物

# medication.mohLimitToggle
source: Set monthly limit (MOH prevention)
zh_hans: 设置月度使用限制（MOH预防）
zh_hant: 設置月度使用限制（MOH預防）

# test.title
source: Test data
zh_hans: 测试数据
zh_hant: 測試數據

# test.alert.success
source: Success
zh_hans: 操作成功
zh_hant: 操作成功

# test.alert.confirmClear
source: Confirm delete all data
zh_hans: 确认删除所有数据
zh_hant: 確認刪除所有數據

# test.clearConfirmMessage
source: This will permanently delete all records, medications and custom labels. Continue?
zh_hans: 此操作将删除所有发作记录、药物和自定义标签，且不可恢复。确定要继续吗？
zh_hant: 此操作將刪除所有發作記錄、藥物和自訂標籤，且不可恢復。確定要繼續嗎？

# test.alert.finalConfirm
source: Final confirmation
zh_hans: 最后确认
zh_hant: 最後確認

# test.clearAllData
source: Delete all data
zh_hans: 删除所有数据
zh_hant: 刪除所有數據

# test.deleteStatsDetail
source: About to delete: • %d attack records • %d medications • %d custom labels • %d health events • %d user profiles • %d medication logs Cannot be undone!
zh_hans: 即将删除： • %d 条发作记录 • %d 种药物 • %d 个自定义标签 • %d 个健康事件 • %d 个用户档案 • %d 条用药日志 此操作不可恢复！
zh_hant: 即將刪除： • %d 條發作記錄 • %d 種藥物 • %d 個自訂標籤 • %d 個健康事件 • %d 個用戶檔案 • %d 條用藥日誌 此操作不可恢復！

# test.deleteAllWarning
source: All data will be deleted. Cannot be undone!
zh_hans: 即将删除所有数据，此操作不可恢复！
zh_hant: 即將刪除所有數據，此操作不可恢復！

# test.selectiveClearTitle
source: Select data to clear
zh_hans: 选择要清空的数据
zh_hant: 選擇要清空的數據

# test.clearRecords
source: Clear attack records
zh_hans: 清空发作记录
zh_hant: 清空發作記錄

# test.clearMedications
source: Clear cabinet
zh_hans: 清空药箱数据
zh_hant: 清空藥箱數據

# test.clearCustomLabels
source: Clear custom labels
zh_hans: 清空自定义标签
zh_hant: 清空自訂標籤

# test.clearHealthEvents
source: Clear health events
zh_hans: 清空健康事件
zh_hant: 清空健康事件

source: Test environment
zh_hans: 测试环境
zh_hant: 測試環境

# test.environmentHint
source: Debug only. Generated data saves to database.
zh_hans: 此功能仅在 Debug 模式下可用，生成的数据会保存到数据库中
zh_hant: 此功能僅在 Debug 模式下可用，生成的數據會保存到資料庫中

# test.premiumTest
source: Premium test
zh_hans: 高级版测试
zh_hant: 高級版測試

# test.simulatePremium
source: Simulate premium
zh_hans: 模拟高级版
zh_hant: 模擬高級版

# test.simulatePremiumHint
source: Test all premium features without purchase
zh_hans: 开启后可测试所有高级功能，无需实际购买
zh_hant: 開啟後可測試所有高級功能，無需實際購買

# test.currentStatus
source: Current status
zh_hans: 当前状态
zh_hant: 當前狀態

# test.premium
source: Premium
zh_hans: 高级版
zh_hant: 高級版

# test.free
source: Free
zh_hans: 免费版
zh_hant: 免費版

# test.debugModeHint
source: Test mode active, premium controlled by switch
zh_hans: 测试模式已激活，高级版状态由此开关控制
zh_hant: 測試模式已激活，高級版狀態由此開關控制

# test.resetToReal
source: Reset to real status
zh_hans: 重置为真实状态
zh_hant: 重置為真實狀態

# test.currentStats
source: Current data
zh_hans: 当前数据统计
zh_hant: 當前數據統計

# test.statsTotal
source: %d items total
zh_hans: 共 %d 项
zh_hant: 共 %d 項

# test.stat.records
source: Attack records
zh_hans: 发作记录
zh_hant: 發作記錄

# test.stat.medications
source: Medications
zh_hans: 药物
zh_hant: 藥物

# test.stat.labels
source: Labels
zh_hans: 标签
zh_hant: 標籤

# test.stat.healthEvents
source: Health events
zh_hans: 健康事件
zh_hant: 健康事件

# test.stat.userProfiles
source: User profiles
zh_hans: 用户档案
zh_hant: 用戶檔案

# test.stat.medicationLogs
source: Medication logs
zh_hans: 用药日志
zh_hant: 用藥日誌

# test.attackRecordTitle
source: Attack records
zh_hans: 发作记录生成
zh_hant: 發作記錄生成

# test.monthCount
source: Months
zh_hans: 月份数
zh_hant: 月份數

# test.monthsFormat
source: %d months
zh_hans: %d 个月
zh_hant: %d 個月

# test.generatePastMonths
source: Generate past %d months
zh_hans: 生成过去 %d 个月的数据
zh_hant: 生成過去 %d 個月的數據

# test.attacksPerMonth
source: Per month
zh_hans: 每月频次
zh_hant: 每月頻次

# test.timesFormat
source: %d times
zh_hans: %d 次
zh_hant: %d 次

# test.attacksPerMonthHint
source: %d attacks/month, ~%d records total
zh_hans: 每月发作 %d 次，共约 %d 条记录
zh_hant: 每月發作 %d 次，共約 %d 條記錄

# test.avgDuration
source: Avg duration
zh_hans: 平均持续时长
zh_hant: 平均持續時長

# test.avgDurationHint
source: Avg %.1f hours per attack
zh_hans: 发作平均持续 %.1f 小时
zh_hant: 發作平均持續 %.1f 小時

# test.durationVariance
source: Duration variance
zh_hans: 时长变化范围
zh_hant: 時長變化範圍

# test.durationVarianceHint
source: Duration %.1f - %.1f hours
zh_hans: 持续时间约在 %.1f - %.1f 小时之间
zh_hant: 持續時間約在 %.1f - %.1f 小時之間

# test.generating
source: Generating...
zh_hans: 生成中...
zh_hant: 生成中...

# test.generateRecords
source: Generate records
zh_hans: 生成记录
zh_hant: 生成記錄

# test.medicationTitle
source: Medications
zh_hans: 药箱数据生成
zh_hant: 藥箱數據生成

# test.medicationCount
source: Count
zh_hans: 药品数量
zh_hant: 藥品數量

# test.kindsFormat
source: %d kinds
zh_hans: %d 种
zh_hant: %d 種

# test.generateMedicationsHint
source: Generate %d medications with categories and inventory
zh_hans: 生成 %d 种药物，包含各类别和库存信息
zh_hant: 生成 %d 種藥物，包含各類別和庫存信息

# test.generateMedications
source: Generate medications
zh_hans: 生成药箱
zh_hant: 生成藥箱

# test.customLabelsTitle
source: Custom labels
zh_hans: 自定义标签生成
zh_hant: 自訂標籤生成

# test.labelCount
source: Labels
zh_hans: 标签数量
zh_hant: 標籤數量

# test.itemsFormat
source: %d items
zh_hans: %d 个
zh_hant: %d 個

# test.generateLabelsHint
source: Generate %d custom labels (symptoms, triggers)
zh_hans: 生成 %d 个自定义标签（症状和诱因）
zh_hant: 生成 %d 個自訂標籤（症狀和誘因）

# test.generateLabels
source: Generate labels
zh_hans: 生成标签
zh_hant: 生成標籤

# test.healthEventsTitle
source: Health events
zh_hans: 健康事件生成
zh_hant: 健康事件生成

# test.eventCount
source: Events
zh_hans: 事件数量
zh_hant: 事件數量

# test.eventsFormat
source: %d events
zh_hans: %d 个
zh_hant: %d 個

# test.generateEventsHint
source: Generate %d health events
zh_hans: 生成 %d 个健康事件记录
zh_hant: 生成 %d 個健康事件記錄

# test.timeRange
source: Time range
zh_hans: 时间范围
zh_hant: 時間範圍

# test.daysFormat
source: %d days
zh_hans: %d 天
zh_hant: %d 天

# test.eventDayRangeHint
source: Random in past %d days (medication, TCM, surgery)
zh_hans: 在过去 %d 天内随机分布（用药、中医治疗、手术等）
zh_hant: 在過去 %d 天內隨機分佈（用藥、中醫治療、手術等）

# test.generateHealthEvents
source: Generate health events
zh_hans: 生成健康事件
zh_hant: 生成健康事件

# test.userProfileTitle
source: User profile
zh_hans: 用户档案生成
zh_hant: 用戶檔案生成

# test.generateUserProfileHint
source: Generate random test profile (name, age, gender, history)
zh_hans: 生成一个包含随机信息的测试用户档案（姓名、年龄、性别、病史等）
zh_hant: 生成一個包含隨機信息的測試用戶檔案（姓名、年齡、性別、病史等）

# test.generateUserProfile
source: Generate profile
zh_hans: 生成用户档案
zh_hant: 生成用戶檔案

# test.dangerZone
source: Danger zone
zh_hans: 危险操作
zh_hant: 危險操作

# test.dangerZoneHint
source: These actions permanently delete data
zh_hans: 以下操作将永久删除数据，无法恢复
zh_hant: 以下操作將永久刪除數據，無法恢復

# test.selectiveClear
source: Selective clear
zh_hans: 选择性清空
zh_hant: 選擇性清空

# test.confirmDelete
source: Confirm delete
zh_hans: 确认删除
zh_hant: 確認刪除

# test.confirmDeleteHint
source: Type 'confirm delete' to continue
zh_hans: 请输入 '确认删除' 以继续
zh_hant: 請輸入 '確認刪除' 以繼續

# test.confirmDeletePlaceholder
source: Enter: confirm delete
zh_hans: 请输入：确认删除
zh_hant: 請輸入：確認刪除

# test.aboutToDelete
source: About to delete:
zh_hans: 即将删除：
zh_hant: 即將刪除：

# test.recordsCount
source: %d records
zh_hans: %d 条记录
zh_hant: %d 條記錄

# test.medicationsCount
source: %d medications
zh_hans: %d 种药物
zh_hant: %d 種藥物

# test.labelsCount
source: %d labels
zh_hans: %d 个标签
zh_hant: %d 個標籤

# test.healthEventsCount
source: %d health events
zh_hans: %d 个健康事件
zh_hant: %d 個健康事件

# test.userProfilesCount
source: %d user profiles
zh_hans: %d 个用户档案
zh_hant: %d 個用戶檔案

# test.successRecords
source: Generated %d attack records
zh_hans: 成功生成 %d 条发作记录
zh_hant: 成功生成 %d 條發作記錄

# test.generateFailed
source: Generation failed: %@
zh_hans: 生成失败：%@
zh_hant: 生成失敗：%@

# test.successMedications
source: Generated %d medications
zh_hans: 成功生成 %d 种药物
zh_hant: 成功生成 %d 種藥物

# test.successLabels
source: Generated %d custom labels
zh_hans: 成功生成 %d 个自定义标签
zh_hant: 成功生成 %d 個自訂標籤

# test.successHealthEvents
source: Generated %d health events (past %d days)
zh_hans: 成功生成 %d 个健康事件（过去%d天）
zh_hant: 成功生成 %d 個健康事件（過去%d天）

# test.successUserProfile
source: User profile test data generated
zh_hans: 成功生成用户档案测试数据
zh_hant: 成功生成用戶檔案測試數據

# test.clearedAll
source: All data cleared
zh_hans: 已清空所有数据
zh_hant: 已清空所有數據

# test.clearFailed
source: Clear failed: %@
zh_hans: 清空失败：%@
zh_hant: 清空失敗：%@

# test.clearedRecords
source: All attack records cleared
zh_hans: 已清空所有发作记录
zh_hant: 已清空所有發作記錄

# test.clearedMedications
source: All medications cleared
zh_hans: 已清空所有药物
zh_hant: 已清空所有藥物

# test.clearedLabels
source: All custom labels cleared
zh_hans: 已清空所有自定义标签
zh_hant: 已清空所有自訂標籤

# test.clearedHealthEvents
source: All health events cleared
zh_hans: 已清空所有健康事件
zh_hant: 已清空所有健康事件

# health.event.add.title
source: Add Health Event
zh_hans: 添加健康事件
zh_hant: 添加健康事件

# health.event.type.picker
source: Event Type
zh_hans: 事件类型
zh_hant: 事件類型

# health.event.type.select
source: Select event type
zh_hans: 选择事件类型
zh_hant: 選擇事件類型

# health.event.datetime
source: Date & Time
zh_hans: 日期时间
zh_hant: 日期時間

# health.event.occurred.time
source: When
zh_hans: 发生时间
zh_hant: 發生時間

# health.event.notes.placeholder
source: Notes (optional)
zh_hans: 记录备注（可选）
zh_hant: 記錄備註（可選）

# health.event.add.medication
source: Add Medication
zh_hans: 添加用药
zh_hant: 添加用藥

# health.event.unknown.medication
source: Unknown medication
zh_hans: 未知药物
zh_hant: 未知藥物

# health.event.medication.info
source: Medication Info
zh_hans: 药物信息
zh_hant: 藥物信息

# health.event.medication.count
source: %d medications added
zh_hans: 已添加 %d 种药物
zh_hant: 已添加 %d 種藥物

# health.event.treatment.type
source: Treatment Type
zh_hans: 治疗类型
zh_hant: 治療類型

# health.event.treatment.type.placeholder
source: Enter treatment type
zh_hans: 请输入治疗类型
zh_hant: 請輸入治療類型

# health.event.duration.optional
source: Duration (optional)
zh_hans: 治疗时长（可选）
zh_hant: 治療時長（可選）

# health.event.surgery.name
source: Surgery Name
zh_hans: 手术名称
zh_hant: 手術名稱

# health.event.surgery.info
source: Surgery Info
zh_hans: 手术信息
zh_hant: 手術信息

# health.event.hospital.optional
source: Hospital (optional)
zh_hans: 医院名称（可选）
zh_hant: 醫院名稱（可選）

# health.event.doctor.optional
source: Doctor (optional)
zh_hans: 医生姓名（可选）
zh_hant: 醫生姓名（可選）

# health.event.medical.facility
source: Medical Facility
zh_hans: 医疗机构
zh_hant: 醫療機構

# settings.theme.subtitle
source: Theme
zh_hans: 主题
zh_hant: 主題

# settings.location.title
source: Location Services
zh_hans: 位置服务
zh_hant: 位置服務

# settings.location.desc
source: Allow location access to fetch weather data for environmental trigger analysis.
zh_hans: 允许访问位置信息以获取天气数据，帮助分析环境诱因。
zh_hant: 允許訪問位置信息以獲取天氣數據，幫助分析環境誘因。

# settings.location.features
source: Features
zh_hans: 功能说明
zh_hant: 功能說明

# settings.location.feature.weather
source: Record weather during attacks
zh_hans: 记录发作时的天气状况
zh_hant: 記錄發作時的天氣狀況

# settings.location.feature.pressure
source: Pressure trend analysis
zh_hans: 气压变化趋势分析
zh_hant: 氣壓變化趨勢分析

# settings.location.feature.temp
source: Temperature and humidity
zh_hans: 湿度和温度追踪
zh_hant: 濕度和溫度追蹤

# settings.open.settings
source: Open System Settings
zh_hans: 打开系统设置
zh_hant: 打開系統設置

# settings.icloud.enable
source: Enable iCloud Sync
zh_hans: 启用iCloud同步
zh_hant: 啟用iCloud同步

# settings.icloud.off.desc
source: Data saved locally only when off
zh_hans: 关闭后数据仅保存在本地设备
zh_hant: 關閉後數據僅保存在本地設備

# settings.icloud.restart.hint
source: Restart required for changes to take effect
zh_hans: 更改此设置后需要重启应用才能生效
zh_hant: 更改此設置後需要重啟應用才能生效

# settings.icloud.title
source: iCloud Sync
zh_hans: iCloud同步
zh_hant: iCloud同步

# settings.icloud.desc
source: All your data syncs automatically to your Apple devices and is stored in your private database.
zh_hans: 您的所有数据通过iCloud自动同步到您的所有Apple设备，并保存在您的私有数据库中。
zh_hant: 您的所有數據通過iCloud自動同步到您的所有Apple設備，並保存在您的私有數據庫中。

# settings.sync.features
source: Sync features
zh_hans: 同步说明
zh_hant: 同步說明

# settings.sync.cross.device
source: Cross-device sync
zh_hans: 自动跨设备同步
zh_hant: 自動跨設備同步
